import { FaqCategory } from "../models/faq.model";

export const FAQ_CATEGORIES: FaqCategory[] = [
  {
    id: 'Deposit',
    title: 'ระบบการฝากเงินบาท',
    questions: [
      'วิธีผูกบัญชีธนาคารทำอย่างไร',
      'วิธีฝากเงินบาททำอย่างไร',
      'ยกเลิกรายการฝากเงินบาททำอย่างไร'
    ]
  },
  {
    id: 'Withdraw',
    title: 'ระบบการถอนเงินบาท',
    questions: [
      'วิธีถอนเงินบาททำอย่างไร',
      'ทำไมถึงไม่สามารถทำการถอนเงินได้',
      'ยังไม่ได้รับเงินถอนเข้าบัญชีธนาคาร ทำอย่างไร'
    ]
  },
  {
    id: 'KYC',
    title: 'การยืนยันตัวตน (KYC)',
    questions: [
      'วิธีการยืนยันตัวตน (KYC) ให้สมบูรณ์ทำอย่างไร',
      'วิธีตรวจสอบสถานะ KYC ดูอย่างไร',
      'มีบัญชีที่ผ่านการยืนยันตัวตนอยู่แล้วทำอย่างไร',
      'ทำไมต้องยืนยันตัวตน (KYC)',
      'NDID คืออะไร',
      'วิธียืนยันตัวตนผ่าน NDID ทำอย่างไร',
      'ยืนยันตัวตนไม่สำเร็จ เกิดจากสาเหตุอะไร'
    ]
  },
  {
    id: 'Security',
    title: 'ความปลอดภัย & ความถูกต้องของบัญชี',
    questions: [
      'เบอร์โทรศัพท์ไม่สามารถใช้งานได้',
      'Google Authenticator (2FA) ไม่สามารถใช้งานได้',
      'วิธีเปลี่ยนอีเมลทำอย่างไร',
      'ไม่ได้รับรหัส SMS',
      'ส่งรหัสยืนยันบ่อยเกินไป',
      'รหัส Google 2FA ผิดพลาด',
      'เปิดใช้งาน Google Authenticator (2FA) อย่างไร'
    ]
  },
  {
    id: 'Crypto',
    title: 'การฝาก-ถอน คริปโต (Crypto)',
    questions: [
      'วิธีฝากคริปโตเข้าบัญชี Binance TH / กระดานเทรด',
      'ตรวจสอบ TxID หรือ hash id อย่างไร',
      'ธุรกรรมฝากคริปโตยังไม่ถูกยืนยันบนบล็อกเชน',
      'ฝากคริปโตผิดพลาด ทำอย่างไร',
      'ไม่สามารถสร้างที่อยู่อิเล็กทรอนิกส์ในการฝากสินทรัพย์ดิจิทัลได้',
      'ค่าธรรมเนียมรายการถอน Crypto เท่าไหร่',
      'ยอดคงเหลือไม่เพียงพอต่อการถอนสินทรัพย์ดิจิทัล',
      'ขั้นตอนการถอนคริปโตจากบัญชีไป Binance TH / กระดานเทรด',
      'ถอนคริปโตผิดพลาด ทำอย่างไร'
    ]
  }
];